/**
 * 数据结构分为逻辑结构和存储结构
 * ------逻辑结构
 * I.
 * 集合，就是所有元素没有任何关联
 * II.
 * 线性结构，一对一的关联关系
 * <p>
 * II.
 * 树形结构
 * 1对多
 * III.
 * 图结构,多对多
 * -----存储结构
 * I.
 * 数组
 * II.
 * 链表，链式存储
 * III.
 * 索引存储
 * IIII.
 * 散列存储
 * <p>
 * <p>
 * _________________________ADT_________________________
 * 抽象数据类型，就是逻辑上抽象出来的数据类型，和在这个抽象数据类型的操作
 * eg 比如栈的抽象数据类型，我们不管栈是数组实现的还是链表实现的，但是只要是栈的数据结构我们就直到
 * 应该遵循FILO，并且有pop(弹出栈顶元素)和push(压栈)这样的操作
 *
 * 在线小程序演示
 * https://www.cs.usfca.edu/~galles/visualization/RedBlack.html
 */
package com.yang.ds.algorithm;

